Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja2/madsen-n.htm.tmx
Source language: nob
Languages: sme

source: Jeg kan ikke si jeg møtte noen motstand i departementet.
sme: In dovdan makkárge vuostehágu departemeanttas.

source: Arbeidet med Reform 97 startet så vidt i mi tid.
sme: Ođastusa 97 bargu álggahuvvui mu áiggi.

source: Departementet ønsket i utgangspunktet å få en felles plan med en norsk og en samisk del.
sme: Álggedettiin háliidii departemeanta oktasaš plána mas lea dáru ja sámi oassi.

source: Innholdet skulle være mest mulig likt.
sme: Sisdoallu galggai lean nu ovttalágan go vejolaš.

source: Men Samisk utdanningsråd gikk inn for en egen samisk plan.
sme: Muhto Sámi oahpahusráđđi háliidii sierra sámi plána.

source: De mente det ville gi bedre mulighet til gjennomgående å kunne sikre samisk kultur og historie i en egen samisk læreplan.
sme: Doppe oaivvildedje ahte buorebut sáhtášii sihkkarastit sámi kultuvrra ja historjjá sierra sámi oahppoplánas.

source: Den ble vedtatt samtidig med at kjennskap til samene, deres historie og kultur ble integrert i den nasjonale (norske) planen.
sme: Dat mearriduvvui seamma áiggi go našunála plánii integrerejuvvui ahte oahppit galge oahppat dovdat sámiid, sámi historjjá ja kultuvrra.

source: Imponert over Samisk utdanningsråd
sme: Sámi oahpahusráđđi dagai buori barggu

source: – Samisk utdanningsråd var et av de rådene som departementet virkelig hadde nytte av.
sme: – Sámi oahpahusráđđi lei okta dain ráđiin, mii duođaid lei departementii ávkin.

source: Jeg var særlig imponert over den jobben utdanningsrådet gjorde med lærebøker.
sme: Mu mielas dagai Oahpahusráđđi viehka buori barggu oahppogirjjiid hárrái.

source: De fikk mye ut av lite, men jeg vet at de ofte slet med forlagene.
sme: Sii ožžo unnánaččas ollu, muhto dieđán ahte sii dávjá bártidedje lágádusaiguin.

source: På denne tiden startet diskusjonen om Samisk utdanningsråd skulle være under Sametinget.
sme: Dan áiggi ságastallagohte ahte galgá go Sámi oahpahusráđđi šaddat Sámedikki vuollásažžan.

source: Det var ikke noe entydig ønske fra rådets side.
sme: Ráđđi ii nu čielgasit livčče háliidan dan.

source: Sett fra departementets side var det godt med direkte linjer, men jeg håper den løsningen som ble valgt er den beste for samisk skoleutvikling.
sme: Departementii lei hui buorre go ledje njuolgga oktavuođat, muhto sávan ahte válljejuvvon čoavddus lea buoremus sámi skuvlaovdánahttimii.

source: Andre artikler i Samisk skolehistorie 2
sme: Eará artihkkalat girjjis Sámi skuvlahistorjá 2
